In [24]:
import pandas as pd

In [25]:
dict1 ={'Name':['Priyang','Aadhya','Shreyas','Kshitija','Shashank','rama','Rajeev'],
       'Marks':[98,89,99,87,90,83,65],
       'Gender':['Male','Female','Male','Female','Male','Male','Male']
       }

df1=pd.DataFrame(dict1)
df1

       Name  Marks  Gender
0   Priyang     98    Male
1    Aadhya     89  Female
2   Shreyas     99    Male
3  Kshitija     87  Female
4  Shashank     90    Male
5      rama     83    Male
6    Rajeev     65    Male

In [26]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Shreyas     99    Male

In [27]:
df1.tail(3)

       Name  Marks Gender
4  Shashank     90   Male
5      rama     83   Male
6    Rajeev     65   Male

In [28]:
df1.shape

(7, 3)

In [29]:
df1.sort_values(by=['Marks','Gender'],ascending=False)
df1

       Name  Marks  Gender
0   Priyang     98    Male
1    Aadhya     89  Female
2   Shreyas     99    Male
3  Kshitija     87  Female
4  Shashank     90    Male
5      rama     83    Male
6    Rajeev     65    Male

In [33]:
df1[df1['Gender']=='Female']

       Name  Marks  Gender
1    Aadhya     89  Female
3  Kshitija     87  Female